"""
Описание констант проекта.
NAME_COL - номер элемента в списке, содержащего название детали;
MAT_NO_COL - номер элемента в списке, содержащего материальный номер детали;
AMOUNT_COL - номер элемента в списке, содержащего количество деталей;
INSTR_COL - номер элемента в списке, содержащего инструмент, к которому
относится деталь;
REMARK_COL - номер элемента в списке, содержащего заметки о детали;
PLACE_COL - номер элемента в списке, содержащего место детали;
WORKSHEET_LABEL = 'Лист1' - название рабочего листа;
TITLES - названия параметров детали в сообщении для телеграм-бота;
HELP_MESSAGE - текст сообщения для команды /help
START_MESSAGE - текст сообщения для команды /start
SYMBOLS_COUNT - максимально количество символов в сообщении, отправляемого
ботом
"""

NAME_COL = 1
MAT_NO_COL = 2
AMOUNT_COL = 3
INSTR_COL = 4
REMARK_COL = 5
PLACE_COL = 6
WORKSHEET_LABEL = 'Sheet 1'
TITLES = (
    'Номер п/п',
    'Название',
    'Mat_No/Man_ID',
    'Количество',
    'Инструмент',
    'Дополнительно',
    'Место хранения',
)
HELP_MESSAGE = (
    'Чтобы получить доступ к боту, введите пароль. Чтобы начать использовать '
    'бота отправьте команду /start. Для поиска запчасти в таблице просто '
    'отправьте боту информацию о запчасти, которую вы хотите найти. Учтите, '
    'что бот пока не понимает сложные запросы. Например, если отправить '
    'сообщение "syringe e601", бот не будет искать запчасти, относящиеся к '
    'e601, у которых есть слово syringe в названии. Вместо этого  он будет '
    'искать запчасть, у которой в одном из полей встречается такая строка.'
)
START_MESSAGE = (
    'Приветствую! Этот бот предназначен для работы с базой данных б/у '
    'запчастей группы SWA. Для активации бота введите пароль.'
)
MAX_SYMBOLS = 4000
