class PasswordError(Exception):
    """
    Класс исключения.

    Вызывается, если пользователь ввел неверный пароль
    """

    pass


class PasswordOk(Exception):
    """
    Класс исключения.

    Вызывается, если пользователь ввел верный пароль.
    """


class NothingFoundError(Exception):
    """
    Класс исключения.

    Вызывается, если поиск в таблице не дал результатов
    """

    pass


class ToLongResultError(Exception):
    """
    Класс исключения.

    Вызывается, если поиск в таблице дал слишком много результатов
    """


class AccessError(Exception):
    """
    Класс исключения.

    Вызывается, если возникли проблемы с доступом к базе данных запчастей на
    каком-либо этапе
    """
