class PasswordError(Exception):
    """
    Класс исключения.

    Вызывается, если пользователь ввел неверный пароль
    """

    pass


class PasswordOk(Exception):
    """
    Класс исключения.

    Вызывается, если пользователь ввел верный пароль.
    """


class HttpStatusNotOk(Exception):
    """Класс исключения.

     Вызывается в случае, если статус кода ответа сервера отличается от
     HTTPStatus.Ok.
     """

    pass


class NothingFound(Exception):
    """
    Класс исключения.

    Вызывается, если поиск в таблице не дал результатов
    """

    pass


class ToLongResult(Exception):
    """
    Класс исключения.

    Вызывается, если поиск в таблице дал слишком много результатов
    """


class AccessError(Exception):
    """
    Класс исключения.

    Вызывается, если возникли проблемы с доступом к базе данных запчастей на
    каком-либо этапе
    """
